export interface LookupItem {
  id: string
  name: string
}

export interface IndustryLookupItem extends LookupItem {
  taxonomy: "sw"
}

export const RESEARCH_AREAS: LookupItem[] = [
  {
    "id": "122000001",
    "name": "宏观"
  },
  {
    "id": "122000002",
    "name": "策略"
  },
  {
    "id": "122000003",
    "name": "固收"
  },
  {
    "id": "122000004",
    "name": "金工"
  },
  {
    "id": "122000005",
    "name": "海外"
  },
  {
    "id": "100800122",
    "name": "中信非银"
  },
  {
    "id": "100800115",
    "name": "中信消服"
  },
  {
    "id": "100800111",
    "name": "中信电新"
  },
  {
    "id": "100800104",
    "name": "中信电公"
  },
  {
    "id": "100800101",
    "name": "中信石油石化"
  },
  {
    "id": "100800130",
    "name": "中信综合"
  },
  {
    "id": "100800129",
    "name": "中信传媒"
  },
  {
    "id": "100800128",
    "name": "中信计算机"
  },
  {
    "id": "100800127",
    "name": "中信通信"
  },
  {
    "id": "100800126",
    "name": "中信电子"
  },
  {
    "id": "100800125",
    "name": "中信交通运输"
  },
  {
    "id": "100800124",
    "name": "中信综合金融"
  },
  {
    "id": "100800123",
    "name": "中信房地产"
  },
  {
    "id": "100800121",
    "name": "中信银行"
  },
  {
    "id": "100800120",
    "name": "中信农林牧渔"
  },
  {
    "id": "100800119",
    "name": "中信食品饮料"
  },
  {
    "id": "100800118",
    "name": "中信医药"
  },
  {
    "id": "100800117",
    "name": "中信纺织服装"
  },
  {
    "id": "100800116",
    "name": "中信家电"
  },
  {
    "id": "100800114",
    "name": "中信商贸零售"
  },
  {
    "id": "100800113",
    "name": "中信汽车"
  },
  {
    "id": "100800112",
    "name": "中信国防军工"
  },
  {
    "id": "100800110",
    "name": "中信机械"
  },
  {
    "id": "100800109",
    "name": "中信轻工制造"
  },
  {
    "id": "100800108",
    "name": "中信建材"
  },
  {
    "id": "100800107",
    "name": "中信建筑"
  },
  {
    "id": "100800106",
    "name": "中信基础化工"
  },
  {
    "id": "100800105",
    "name": "中信钢铁"
  },
  {
    "id": "100800103",
    "name": "中信有色金属"
  },
  {
    "id": "100800102",
    "name": "中信煤炭"
  },
  {
    "id": "104770000",
    "name": "申万美容护理"
  },
  {
    "id": "104760000",
    "name": "申万环保"
  },
  {
    "id": "104750000",
    "name": "申万石油石化"
  },
  {
    "id": "104740000",
    "name": "申万煤炭"
  },
  {
    "id": "104730000",
    "name": "申万通信"
  },
  {
    "id": "104720000",
    "name": "申万传媒"
  },
  {
    "id": "104710000",
    "name": "申万计算机"
  },
  {
    "id": "104650000",
    "name": "申万国防军工"
  },
  {
    "id": "104640000",
    "name": "申万机械设备"
  },
  {
    "id": "104630000",
    "name": "申万电力设备"
  },
  {
    "id": "104620000",
    "name": "申万建筑装饰"
  },
  {
    "id": "104610000",
    "name": "申万建筑材料"
  },
  {
    "id": "104510000",
    "name": "申万综合"
  },
  {
    "id": "104490000",
    "name": "申万非银金融"
  },
  {
    "id": "104480000",
    "name": "申万银行"
  },
  {
    "id": "104460000",
    "name": "申万社会服务"
  },
  {
    "id": "104450000",
    "name": "申万商贸零售"
  },
  {
    "id": "104430000",
    "name": "申万房地产"
  },
  {
    "id": "104420000",
    "name": "申万交通运输"
  },
  {
    "id": "104410000",
    "name": "申万公用事业"
  },
  {
    "id": "104370000",
    "name": "申万医药生物"
  },
  {
    "id": "104360000",
    "name": "申万轻工制造"
  },
  {
    "id": "104350000",
    "name": "申万纺织服饰"
  },
  {
    "id": "104340000",
    "name": "申万食品饮料"
  },
  {
    "id": "104330000",
    "name": "申万家用电器"
  },
  {
    "id": "104280000",
    "name": "申万汽车"
  },
  {
    "id": "104270000",
    "name": "申万电子"
  },
  {
    "id": "104240000",
    "name": "申万有色金属"
  },
  {
    "id": "104230000",
    "name": "申万钢铁"
  },
  {
    "id": "104220000",
    "name": "申万基础化工"
  },
  {
    "id": "104110000",
    "name": "申万农林牧渔"
  }
]

export const BROKER_ORGS: LookupItem[] = [
  {
    "id": "C800150015",
    "name": "野村证券"
  },
  {
    "id": "C800150624",
    "name": "星展银行"
  },
  {
    "id": "C100000001",
    "name": "渤海证券"
  },
  {
    "id": "C100000007",
    "name": "山西证券"
  },
  {
    "id": "C100000009",
    "name": "西南证券"
  },
  {
    "id": "C100000010",
    "name": "南京证券"
  },
  {
    "id": "C100000011",
    "name": "世纪证券"
  },
  {
    "id": "C100000012",
    "name": "中天证券"
  },
  {
    "id": "C100000013",
    "name": "大通证券"
  },
  {
    "id": "C100000014",
    "name": "华泰证券"
  },
  {
    "id": "C100000016",
    "name": "东吴证券"
  },
  {
    "id": "C100000017",
    "name": "东海证券"
  },
  {
    "id": "C100000018",
    "name": "中山证券"
  },
  {
    "id": "C100000019",
    "name": "国海证券"
  },
  {
    "id": "C100000020",
    "name": "招商证券"
  },
  {
    "id": "C100000022",
    "name": "开源证券"
  },
  {
    "id": "C100000023",
    "name": "国信证券"
  },
  {
    "id": "C100000024",
    "name": "方正证券"
  },
  {
    "id": "C100000028",
    "name": "英大证券"
  },
  {
    "id": "C100000029",
    "name": "光大证券"
  },
  {
    "id": "C100000030",
    "name": "长城证券"
  },
  {
    "id": "C100000031",
    "name": "平安证券"
  },
  {
    "id": "C100000032",
    "name": "湘财证券"
  },
  {
    "id": "C100000034",
    "name": "民生证券"
  },
  {
    "id": "C100000035",
    "name": "长城国瑞证券"
  },
  {
    "id": "C100000036",
    "name": "国元证券"
  },
  {
    "id": "C100000037",
    "name": "东莞证券"
  },
  {
    "id": "C100000038",
    "name": "华林证券"
  },
  {
    "id": "C100000041",
    "name": "川财证券"
  },
  {
    "id": "C100000042",
    "name": "东方证券"
  },
  {
    "id": "C100000043",
    "name": "第一创业"
  },
  {
    "id": "C100000044",
    "name": "大同证券"
  },
  {
    "id": "C100000045",
    "name": "金融街证券"
  },
  {
    "id": "C100000046",
    "name": "国联民生"
  },
  {
    "id": "C100000048",
    "name": "首创证券"
  },
  {
    "id": "C100000049",
    "name": "东方财富证券"
  },
  {
    "id": "C100000051",
    "name": "兴业证券"
  },
  {
    "id": "C100000052",
    "name": "华西证券"
  },
  {
    "id": "C100000053",
    "name": "五矿证券"
  },
  {
    "id": "C100000054",
    "name": "华金证券"
  },
  {
    "id": "C100000055",
    "name": "华安证券"
  },
  {
    "id": "C100000056",
    "name": "西部证券"
  },
  {
    "id": "C100000057",
    "name": "联储证券"
  },
  {
    "id": "C100000058",
    "name": "华鑫证券"
  },
  {
    "id": "C100000061",
    "name": "华龙证券"
  },
  {
    "id": "C100000062",
    "name": "中泰证券"
  },
  {
    "id": "C100000063",
    "name": "天府证券"
  },
  {
    "id": "C100000064",
    "name": "万联证券"
  },
  {
    "id": "C100000065",
    "name": "国都证券"
  },
  {
    "id": "C100000067",
    "name": "万和证券"
  },
  {
    "id": "C100000068",
    "name": "华创证券"
  },
  {
    "id": "C100000069",
    "name": "红塔证券"
  },
  {
    "id": "C100000070",
    "name": "中银证券"
  },
  {
    "id": "C100000071",
    "name": "华宝证券"
  },
  {
    "id": "C100000072",
    "name": "国融证券"
  },
  {
    "id": "C100000073",
    "name": "财达证券"
  },
  {
    "id": "C100000075",
    "name": "浙商证券"
  },
  {
    "id": "C100000076",
    "name": "金元证券"
  },
  {
    "id": "C100000077",
    "name": "财信证券"
  },
  {
    "id": "C100000078",
    "name": "爱建证券"
  },
  {
    "id": "C100000079",
    "name": "中邮证券"
  },
  {
    "id": "C100000080",
    "name": "中航证券"
  },
  {
    "id": "C100000081",
    "name": "中原证券"
  },
  {
    "id": "C100000082",
    "name": "华源证券"
  },
  {
    "id": "C100000083",
    "name": "国盛证券"
  },
  {
    "id": "C100000084",
    "name": "德邦证券"
  },
  {
    "id": "C100000085",
    "name": "财通证券"
  },
  {
    "id": "C100000086",
    "name": "诚通证券"
  },
  {
    "id": "C100000088",
    "name": "江海证券"
  },
  {
    "id": "C100000089",
    "name": "国开证券"
  },
  {
    "id": "C100000090",
    "name": "太平洋"
  },
  {
    "id": "C100000093",
    "name": "高盛中国证券"
  },
  {
    "id": "C100000095",
    "name": "中信建投"
  },
  {
    "id": "C100000096",
    "name": "国投证券"
  },
  {
    "id": "C100000097",
    "name": "银泰证券"
  },
  {
    "id": "C100000099",
    "name": "中国银河"
  },
  {
    "id": "C100000100",
    "name": "信达证券"
  },
  {
    "id": "C100000101",
    "name": "国新证券"
  },
  {
    "id": "C100000102",
    "name": "东兴证券"
  },
  {
    "id": "C100000103",
    "name": "北京证券"
  },
  {
    "id": "C100000126",
    "name": "申港证券"
  },
  {
    "id": "C100000128",
    "name": "华兴证券"
  },
  {
    "id": "C100000129",
    "name": "东亚前海证券"
  },
  {
    "id": "C100000130",
    "name": "汇丰前海证券"
  },
  {
    "id": "C100000132",
    "name": "野村东方国际证券"
  },
  {
    "id": "C100000133",
    "name": "摩根大通证券中国"
  },
  {
    "id": "C100000135",
    "name": "甬兴证券"
  },
  {
    "id": "C100000137",
    "name": "金圆统一证券"
  },
  {
    "id": "C100000140",
    "name": "星展证券中国"
  },
  {
    "id": "C100000004",
    "name": "华福证券"
  },
  {
    "id": "C100000005",
    "name": "粤开证券"
  },
  {
    "id": "C100000015",
    "name": "东北证券"
  },
  {
    "id": "C100000025",
    "name": "麦高证券"
  },
  {
    "id": "C100000060",
    "name": "上海证券"
  },
  {
    "id": "C100000006",
    "name": "国金证券"
  },
  {
    "id": "C100000008",
    "name": "海通证券"
  },
  {
    "id": "C100000021",
    "name": "广发证券"
  },
  {
    "id": "C100000026",
    "name": "中金公司"
  },
  {
    "id": "C100000027",
    "name": "中信证券"
  },
  {
    "id": "C100000039",
    "name": "长江证券"
  },
  {
    "id": "C100000047",
    "name": "国泰海通"
  },
  {
    "id": "C100000050",
    "name": "天风证券"
  },
  {
    "id": "C100000098",
    "name": "瑞银证券"
  },
  {
    "id": "C100000119",
    "name": "申万宏源证券"
  },
  {
    "id": "C800040335",
    "name": "摩根士丹利"
  },
  {
    "id": "C800065266",
    "name": "巴克莱"
  },
  {
    "id": "C800070012",
    "name": "德意志银行"
  },
  {
    "id": "C800105979",
    "name": "汇丰控股"
  },
  {
    "id": "C800110443",
    "name": "高盛"
  },
  {
    "id": "C800110523",
    "name": "美国银行"
  },
  {
    "id": "C800114009",
    "name": "摩根大通"
  },
  {
    "id": "C800014962",
    "name": "坎特菲茨杰拉德公司"
  },
  {
    "id": "C800015193",
    "name": "巴西投资银行"
  },
  {
    "id": "C800015458",
    "name": "BMO Harris Bank"
  },
  {
    "id": "C800018355",
    "name": "奥尔巴赫格雷森投资"
  },
  {
    "id": "C800019294",
    "name": "Btic America Corporation"
  },
  {
    "id": "C800020171",
    "name": "联昌证券"
  },
  {
    "id": "C800020225",
    "name": "奥地利第一储蓄银行"
  },
  {
    "id": "C800020841",
    "name": "瑞士信贷集团"
  },
  {
    "id": "C800021184",
    "name": "Evercore"
  },
  {
    "id": "C800022831",
    "name": "里昂证券"
  },
  {
    "id": "C800024532",
    "name": "道明证券"
  },
  {
    "id": "C800033691",
    "name": "麦格理"
  },
  {
    "id": "C800038847",
    "name": "古根海姆证券"
  },
  {
    "id": "C800044779",
    "name": "加拿大皇家银行"
  },
  {
    "id": "C800045141",
    "name": "美国投资银行派杰公司"
  },
  {
    "id": "C800050267",
    "name": "法国兴业银行"
  },
  {
    "id": "C800054695",
    "name": "威廉博莱公司"
  },
  {
    "id": "C800055019",
    "name": "Truist证券"
  },
  {
    "id": "C800055550",
    "name": "韦德布什证券"
  },
  {
    "id": "C801298117",
    "name": "Barclays Bank"
  },
  {
    "id": "C801316708",
    "name": "北欧联合银行"
  },
  {
    "id": "C801317677",
    "name": "BNP Paribas SA"
  },
  {
    "id": "C801303042",
    "name": "杰富瑞集团"
  },
  {
    "id": "C801304832",
    "name": "加拿大丰业银行"
  },
  {
    "id": "C801196501",
    "name": "加拿大帝国商业银行"
  },
  {
    "id": "C801196577",
    "name": "贝伦伯格资管"
  },
  {
    "id": "C801196841",
    "name": "挪威DNB投资银行"
  },
  {
    "id": "C801198303",
    "name": "富国证券"
  },
  {
    "id": "C900006685",
    "name": "开普勒盛富证券"
  },
  {
    "id": "C900006686",
    "name": "帕累托证券"
  },
  {
    "id": "C900006687",
    "name": "TD Securities"
  },
  {
    "id": "C900006694",
    "name": "国民银行"
  },
  {
    "id": "C801342605",
    "name": "蒙特利尔银行"
  },
  {
    "id": "C900006697",
    "name": "BTIG"
  },
  {
    "id": "C100000092",
    "name": "高华证券"
  },
  {
    "id": "C100000066",
    "name": "恒泰长财"
  },
  {
    "id": "C100000091",
    "name": "中天国富"
  },
  {
    "id": "C100000107",
    "name": "国联民生证券承销保荐"
  },
  {
    "id": "C100000104",
    "name": "中德证券"
  },
  {
    "id": "C100000117",
    "name": "金通证券"
  },
  {
    "id": "C800016741",
    "name": "伯恩斯坦研究"
  },
  {
    "id": "C800080335",
    "name": "高盛集团"
  },
  {
    "id": "C800090764",
    "name": "花旗银行"
  },
  {
    "id": "C800127057",
    "name": "瑞银集团"
  },
  {
    "id": "C800082057",
    "name": "高盛"
  },
  {
    "id": "C801352341",
    "name": "法巴证券中国"
  },
  {
    "id": "C500000318",
    "name": "上海申银万国证券研究所"
  },
  {
    "id": "C800070011",
    "name": "大和证券"
  },
  {
    "id": "C801318100",
    "name": "法国兴业银行"
  },
  {
    "id": "C900005224",
    "name": "摩根大通"
  },
  {
    "id": "C800025530",
    "name": "银河海外"
  },
  {
    "id": "C800041439",
    "name": "加拿大皇家银行"
  },
  {
    "id": "C800051885",
    "name": "瑞银"
  },
  {
    "id": "C801342334",
    "name": "瑞士信贷"
  },
  {
    "id": "C800031261",
    "name": "杰富瑞金融"
  },
  {
    "id": "C800160866",
    "name": "中信里昂证券"
  },
  {
    "id": "C801322814",
    "name": "挪威银行"
  },
  {
    "id": "C801165257",
    "name": "德意志银行"
  },
  {
    "id": "C800013239",
    "name": "加拿大帝国商业银行"
  },
  {
    "id": "C800035749",
    "name": "贝伦伯格银行"
  },
  {
    "id": "C800103054",
    "name": "蒙特利尔银行"
  },
  {
    "id": "C800100302",
    "name": "加拿大丰业银行"
  },
  {
    "id": "C800103710",
    "name": "National Bank of Canada"
  },
  {
    "id": "C800041170",
    "name": "Piper Sandler"
  },
  {
    "id": "C800090327",
    "name": "花旗"
  },
  {
    "id": "C800142261",
    "name": "威廉博莱"
  },
  {
    "id": "C800096075",
    "name": "海通国际"
  },
  {
    "id": "C900001246",
    "name": "国盛证券"
  },
  {
    "id": "C801361610",
    "name": "国金证券公司"
  }
]

export const MEETING_ORGS: LookupItem[] = [
  {
    "id": "C000000000",
    "name": "公司自发"
  },
  {
    "id": "C100000006",
    "name": "国金证券"
  },
  {
    "id": "C100000015",
    "name": "东北证券"
  },
  {
    "id": "C100000016",
    "name": "东吴证券"
  },
  {
    "id": "C100000019",
    "name": "国海证券"
  },
  {
    "id": "C100000021",
    "name": "广发证券"
  },
  {
    "id": "C100000022",
    "name": "开源证券"
  },
  {
    "id": "C100000023",
    "name": "国信证券"
  },
  {
    "id": "C100000024",
    "name": "方正证券"
  },
  {
    "id": "C100000026",
    "name": "中金公司"
  },
  {
    "id": "C100000027",
    "name": "中信证券"
  },
  {
    "id": "C100000034",
    "name": "民生证券"
  },
  {
    "id": "C100000039",
    "name": "长江证券"
  },
  {
    "id": "C100000042",
    "name": "东方证券"
  },
  {
    "id": "C100000050",
    "name": "天风证券"
  },
  {
    "id": "C100000051",
    "name": "兴业证券"
  },
  {
    "id": "C100000052",
    "name": "华西证券"
  },
  {
    "id": "C100000056",
    "name": "西部证券"
  },
  {
    "id": "C100000062",
    "name": "中泰证券"
  },
  {
    "id": "C100000068",
    "name": "华创证券"
  },
  {
    "id": "C100000075",
    "name": "浙商证券"
  },
  {
    "id": "C100000083",
    "name": "国盛证券"
  },
  {
    "id": "C100000084",
    "name": "德邦证券"
  },
  {
    "id": "C100000085",
    "name": "财通证券"
  },
  {
    "id": "C100000096",
    "name": "国投证券"
  },
  {
    "id": "C100000099",
    "name": "银河证券"
  },
  {
    "id": "C100000100",
    "name": "信达证券"
  },
  {
    "id": "C100000020",
    "name": "招商证券"
  },
  {
    "id": "C100000029",
    "name": "光大证券"
  },
  {
    "id": "C100000014",
    "name": "华泰证券"
  },
  {
    "id": "C100000058",
    "name": "华鑫证券"
  },
  {
    "id": "C100000090",
    "name": "太平洋证券"
  },
  {
    "id": "C100000055",
    "name": "华安证券"
  },
  {
    "id": "C100000009",
    "name": "西南证券"
  },
  {
    "id": "C100000080",
    "name": "中航证券"
  },
  {
    "id": "C200000294",
    "name": "泓德基金"
  },
  {
    "id": "C100000046",
    "name": "国联民生证券"
  },
  {
    "id": "C100000049",
    "name": "东方财富证券"
  },
  {
    "id": "C100000048",
    "name": "首创证券"
  },
  {
    "id": "C100000030",
    "name": "长城证券"
  },
  {
    "id": "C100000004",
    "name": "华福证券"
  },
  {
    "id": "C100000053",
    "name": "五矿证券"
  },
  {
    "id": "C100000128",
    "name": "华兴证券"
  },
  {
    "id": "C100000060",
    "name": "上海证券"
  },
  {
    "id": "C100000129",
    "name": "东亚前海证券"
  },
  {
    "id": "C100000092",
    "name": "高华证券"
  },
  {
    "id": "C100000130",
    "name": "汇丰前海证券"
  },
  {
    "id": "C100000031",
    "name": "平安证券"
  },
  {
    "id": "C100000007",
    "name": "山西证券"
  },
  {
    "id": "C100000126",
    "name": "申港证券"
  },
  {
    "id": "C100000132",
    "name": "野村东方国际"
  },
  {
    "id": "C100000079",
    "name": "中邮证券"
  },
  {
    "id": "C100000041",
    "name": "川财证券"
  },
  {
    "id": "C900005224",
    "name": "摩根大通"
  },
  {
    "id": "C100000103",
    "name": "北京证券"
  },
  {
    "id": "C900000031",
    "name": "帕米尔研究"
  },
  {
    "id": "C800399320",
    "name": "天天基金"
  },
  {
    "id": "C100000102",
    "name": "东兴证券"
  },
  {
    "id": "C200000203",
    "name": "嘉实基金"
  },
  {
    "id": "C801190083",
    "name": "国富基金"
  },
  {
    "id": "C200000202",
    "name": "华安基金"
  },
  {
    "id": "C200000293",
    "name": "天弘基金"
  },
  {
    "id": "C100000071",
    "name": "华宝证券"
  },
  {
    "id": "C200000187",
    "name": "兴业基金"
  },
  {
    "id": "C200000181",
    "name": "九泰基金"
  },
  {
    "id": "C200000168",
    "name": "工银瑞信基金"
  },
  {
    "id": "C200000165",
    "name": "华夏基金"
  },
  {
    "id": "C800726698",
    "name": "慧衍基金"
  },
  {
    "id": "C800250920",
    "name": "汇成基金"
  },
  {
    "id": "C800070921",
    "name": "第一上海证券"
  },
  {
    "id": "C100000036",
    "name": "国元证券"
  },
  {
    "id": "C100000017",
    "name": "东海证券"
  },
  {
    "id": "C100000119",
    "name": "申万宏源证券"
  },
  {
    "id": "C100000047",
    "name": "国泰海通"
  },
  {
    "id": "C100000095",
    "name": "中信建投"
  },
  {
    "id": "C200000163",
    "name": "易方达基金"
  },
  {
    "id": "C200000207",
    "name": "万家基金"
  },
  {
    "id": "C200000265",
    "name": "大成基金"
  },
  {
    "id": "C200000173",
    "name": "国金基金"
  },
  {
    "id": "C200000270",
    "name": "招商基金"
  },
  {
    "id": "C200000276",
    "name": "平安基金"
  },
  {
    "id": "C200000190",
    "name": "广发基金"
  },
  {
    "id": "C100000070",
    "name": "中银证券"
  },
  {
    "id": "C200000263",
    "name": "鹏华基金"
  },
  {
    "id": "C100000054",
    "name": "华金证券"
  },
  {
    "id": "C200000201",
    "name": "国泰基金"
  },
  {
    "id": "C200000170",
    "name": "华商基金"
  },
  {
    "id": "C100000135",
    "name": "甬兴证券"
  },
  {
    "id": "C200000223",
    "name": "汇添富基金"
  },
  {
    "id": "C200000228",
    "name": "中欧基金"
  },
  {
    "id": "C800164483",
    "name": "中银国际证券"
  },
  {
    "id": "C100000082",
    "name": "华源证券"
  },
  {
    "id": "C200000300",
    "name": "南华基金"
  },
  {
    "id": "C100000078",
    "name": "爱建证券"
  },
  {
    "id": "C100000001",
    "name": "渤海证券"
  },
  {
    "id": "C100000073",
    "name": "财达证券"
  },
  {
    "id": "C100000081",
    "name": "中原证券"
  },
  {
    "id": "C100000044",
    "name": "大同证券"
  },
  {
    "id": "C100000037",
    "name": "东莞证券"
  },
  {
    "id": "C100000005",
    "name": "粤开证券"
  },
  {
    "id": "C100000028",
    "name": "英大证券"
  },
  {
    "id": "C100000065",
    "name": "国都证券"
  },
  {
    "id": "C100000097",
    "name": "银泰证券"
  },
  {
    "id": "C100000045",
    "name": "金融街证券"
  },
  {
    "id": "C100000063",
    "name": "宏信证券"
  },
  {
    "id": "C100000032",
    "name": "湘财证券"
  },
  {
    "id": "C100000064",
    "name": "万联证券"
  },
  {
    "id": "C100000011",
    "name": "世纪证券"
  },
  {
    "id": "C100000010",
    "name": "南京证券"
  },
  {
    "id": "C100000076",
    "name": "金元证券"
  },
  {
    "id": "C100000088",
    "name": "江海证券"
  },
  {
    "id": "C100000101",
    "name": "国新证券"
  },
  {
    "id": "C100000086",
    "name": "诚通证券"
  },
  {
    "id": "C200000275",
    "name": "民生加银基金"
  },
  {
    "id": "C200000272",
    "name": "景顺长城基金"
  },
  {
    "id": "C600000255",
    "name": "恒泰期货"
  },
  {
    "id": "C100000061",
    "name": "华龙证券"
  },
  {
    "id": "C600000293",
    "name": "南华期货"
  },
  {
    "id": "C600000301",
    "name": "中州期货"
  },
  {
    "id": "C600000275",
    "name": "国联期货"
  },
  {
    "id": "C600000312",
    "name": "国信期货"
  },
  {
    "id": "C600000253",
    "name": "光大期货"
  },
  {
    "id": "C600000358",
    "name": "平安期货"
  },
  {
    "id": "C600000292",
    "name": "新湖期货"
  },
  {
    "id": "C600000267",
    "name": "东证期货"
  },
  {
    "id": "C600000333",
    "name": "广发期货"
  },
  {
    "id": "C600000304",
    "name": "徽商期货"
  },
  {
    "id": "C600000237",
    "name": "兴证期货"
  },
  {
    "id": "C100000025",
    "name": "麦高证券"
  },
  {
    "id": "C600000221",
    "name": "国泰君安期货"
  }
]

export const INDUSTRIES: IndustryLookupItem[] = [
  {
    "id": "104410000",
    "name": "公用事业",
    "taxonomy": "sw"
  },
  {
    "id": "104640000",
    "name": "机械设备",
    "taxonomy": "sw"
  },
  {
    "id": "104630000",
    "name": "电力设备",
    "taxonomy": "sw"
  },
  {
    "id": "104770000",
    "name": "美容护理",
    "taxonomy": "sw"
  },
  {
    "id": "104450000",
    "name": "商贸零售",
    "taxonomy": "sw"
  },
  {
    "id": "104730000",
    "name": "通信",
    "taxonomy": "sw"
  },
  {
    "id": "104430000",
    "name": "房地产",
    "taxonomy": "sw"
  },
  {
    "id": "104420000",
    "name": "交通运输",
    "taxonomy": "sw"
  },
  {
    "id": "104650000",
    "name": "国防军工",
    "taxonomy": "sw"
  },
  {
    "id": "104360000",
    "name": "轻工制造",
    "taxonomy": "sw"
  },
  {
    "id": "104280000",
    "name": "汽车",
    "taxonomy": "sw"
  },
  {
    "id": "104740000",
    "name": "煤炭",
    "taxonomy": "sw"
  },
  {
    "id": "104760000",
    "name": "环保",
    "taxonomy": "sw"
  },
  {
    "id": "104340000",
    "name": "食品饮料",
    "taxonomy": "sw"
  },
  {
    "id": "104710000",
    "name": "计算机",
    "taxonomy": "sw"
  },
  {
    "id": "104240000",
    "name": "有色金属",
    "taxonomy": "sw"
  },
  {
    "id": "104490000",
    "name": "非银金融",
    "taxonomy": "sw"
  },
  {
    "id": "104510000",
    "name": "综合",
    "taxonomy": "sw"
  },
  {
    "id": "104620000",
    "name": "建筑装饰",
    "taxonomy": "sw"
  },
  {
    "id": "104350000",
    "name": "纺织服饰",
    "taxonomy": "sw"
  },
  {
    "id": "104330000",
    "name": "家用电器",
    "taxonomy": "sw"
  },
  {
    "id": "104370000",
    "name": "医药生物",
    "taxonomy": "sw"
  },
  {
    "id": "104230000",
    "name": "钢铁",
    "taxonomy": "sw"
  },
  {
    "id": "104460000",
    "name": "社会服务",
    "taxonomy": "sw"
  },
  {
    "id": "104110000",
    "name": "农林牧渔",
    "taxonomy": "sw"
  },
  {
    "id": "104480000",
    "name": "银行",
    "taxonomy": "sw"
  },
  {
    "id": "104720000",
    "name": "传媒",
    "taxonomy": "sw"
  },
  {
    "id": "104220000",
    "name": "基础化工",
    "taxonomy": "sw"
  },
  {
    "id": "104610000",
    "name": "建筑材料",
    "taxonomy": "sw"
  },
  {
    "id": "104750000",
    "name": "石油石化",
    "taxonomy": "sw"
  },
  {
    "id": "104270000",
    "name": "电子",
    "taxonomy": "sw"
  }
]
