import type { AnnouncementCategoryItem } from "./types.js"

export const announcementCategories: AnnouncementCategoryItem[] = [
  {
    "id": "103910100",
    "name": "IPO",
    "level": 1,
    "parentId": "103910000"
  },
  {
    "id": "103910101",
    "name": "招股说明书(申报稿)",
    "level": 2,
    "parentId": "103910100"
  },
  {
    "id": "103910102",
    "name": "申报反馈",
    "level": 2,
    "parentId": "103910100"
  },
  {
    "id": "103910103",
    "name": "招股说明书",
    "level": 2,
    "parentId": "103910100"
  },
  {
    "id": "103910104",
    "name": "发行定价",
    "level": 2,
    "parentId": "103910100"
  },
  {
    "id": "103910105",
    "name": "发行结果",
    "level": 2,
    "parentId": "103910100"
  },
  {
    "id": "103910106",
    "name": "上市公告书",
    "level": 2,
    "parentId": "103910100"
  },
  {
    "id": "103910108",
    "name": "其他首发公告",
    "level": 2,
    "parentId": "103910100"
  },
  {
    "id": "103910200",
    "name": "财务报告",
    "level": 1,
    "parentId": "103910000"
  },
  {
    "id": "103910201",
    "name": "业绩预告",
    "level": 2,
    "parentId": "103910200"
  },
  {
    "id": "103910202",
    "name": "业绩快报",
    "level": 2,
    "parentId": "103910200"
  },
  {
    "id": "103910203",
    "name": "一季度报告",
    "level": 2,
    "parentId": "103910200"
  },
  {
    "id": "103910205",
    "name": "三季度报告",
    "level": 2,
    "parentId": "103910200"
  },
  {
    "id": "103910207",
    "name": "半年度报告",
    "level": 2,
    "parentId": "103910200"
  },
  {
    "id": "103910208",
    "name": "年度报告",
    "level": 2,
    "parentId": "103910200"
  },
  {
    "id": "103910209",
    "name": "补充更正",
    "level": 2,
    "parentId": "103910200"
  },
  {
    "id": "103910210",
    "name": "其他财务报告",
    "level": 2,
    "parentId": "103910200"
  },
  {
    "id": "103910214",
    "name": "财报摘要",
    "level": 2,
    "parentId": "103910200"
  },
  {
    "id": "103910300",
    "name": "重大事项",
    "level": 1,
    "parentId": "103910000"
  },
  {
    "id": "103910301",
    "name": "董事会公告",
    "level": 2,
    "parentId": "103910300"
  },
  {
    "id": "103910302",
    "name": "股东大会公告",
    "level": 2,
    "parentId": "103910300"
  },
  {
    "id": "103910303",
    "name": "利润分配",
    "level": 2,
    "parentId": "103910300"
  },
  {
    "id": "103910304",
    "name": "资产重组",
    "level": 2,
    "parentId": "103910300"
  },
  {
    "id": "103910305",
    "name": "收购兼并",
    "level": 2,
    "parentId": "103910300"
  },
  {
    "id": "103910306",
    "name": "关联交易",
    "level": 2,
    "parentId": "103910300"
  },
  {
    "id": "103910307",
    "name": "借贷担保",
    "level": 2,
    "parentId": "103910300"
  },
  {
    "id": "103910308",
    "name": "合同及协议",
    "level": 2,
    "parentId": "103910300"
  },
  {
    "id": "103910309",
    "name": "人事变动",
    "level": 2,
    "parentId": "103910300"
  },
  {
    "id": "103910310",
    "name": "资金投向",
    "level": 2,
    "parentId": "103910300"
  },
  {
    "id": "103910311",
    "name": "违纪违规",
    "level": 2,
    "parentId": "103910300"
  },
  {
    "id": "103910319",
    "name": "资金占用",
    "level": 2,
    "parentId": "103910300"
  },
  {
    "id": "103910400",
    "name": "交易提示",
    "level": 1,
    "parentId": "103910000"
  },
  {
    "id": "103910401",
    "name": "停复牌提示",
    "level": 2,
    "parentId": "103910400"
  },
  {
    "id": "103910402",
    "name": "交易异动",
    "level": 2,
    "parentId": "103910400"
  },
  {
    "id": "103910403",
    "name": "澄清致歉",
    "level": 2,
    "parentId": "103910400"
  },
  {
    "id": "103910404",
    "name": "风险提示",
    "level": 2,
    "parentId": "103910400"
  },
  {
    "id": "103910405",
    "name": "特别处理",
    "level": 2,
    "parentId": "103910400"
  },
  {
    "id": "103910406",
    "name": "终止上市",
    "level": 2,
    "parentId": "103910400"
  },
  {
    "id": "103910407",
    "name": "恢复上市",
    "level": 2,
    "parentId": "103910400"
  },
  {
    "id": "103910408",
    "name": "暂停上市",
    "level": 2,
    "parentId": "103910400"
  },
  {
    "id": "103910409",
    "name": "披露提示",
    "level": 2,
    "parentId": "103910400"
  },
  {
    "id": "103910500",
    "name": "配股",
    "level": 1,
    "parentId": "103910000"
  },
  {
    "id": "103910501",
    "name": "配股预案",
    "level": 2,
    "parentId": "103910500"
  },
  {
    "id": "103910502",
    "name": "配股说明书",
    "level": 2,
    "parentId": "103910500"
  },
  {
    "id": "103910503",
    "name": "配股获准",
    "level": 2,
    "parentId": "103910500"
  },
  {
    "id": "103910504",
    "name": "配股发行",
    "level": 2,
    "parentId": "103910500"
  },
  {
    "id": "103910505",
    "name": "配股上市",
    "level": 2,
    "parentId": "103910500"
  },
  {
    "id": "103910506",
    "name": "配股结果",
    "level": 2,
    "parentId": "103910500"
  },
  {
    "id": "103910507",
    "name": "其他配股公告",
    "level": 2,
    "parentId": "103910500"
  },
  {
    "id": "103910600",
    "name": "增发",
    "level": 1,
    "parentId": "103910000"
  },
  {
    "id": "103910601",
    "name": "增发预案",
    "level": 2,
    "parentId": "103910600"
  },
  {
    "id": "103910602",
    "name": "增发说明书",
    "level": 2,
    "parentId": "103910600"
  },
  {
    "id": "103910603",
    "name": "增发获准",
    "level": 2,
    "parentId": "103910600"
  },
  {
    "id": "103910604",
    "name": "增发发行",
    "level": 2,
    "parentId": "103910600"
  },
  {
    "id": "103910605",
    "name": "增发上市",
    "level": 2,
    "parentId": "103910600"
  },
  {
    "id": "103910607",
    "name": "其他增发公告",
    "level": 2,
    "parentId": "103910600"
  },
  {
    "id": "103910608",
    "name": "增发结果",
    "level": 2,
    "parentId": "103910600"
  },
  {
    "id": "103910700",
    "name": "股权股本",
    "level": 1,
    "parentId": "103910000"
  },
  {
    "id": "103910701",
    "name": "股权变动",
    "level": 2,
    "parentId": "103910700"
  },
  {
    "id": "103910702",
    "name": "股本变动",
    "level": 2,
    "parentId": "103910700"
  },
  {
    "id": "103910703",
    "name": "质押冻结",
    "level": 2,
    "parentId": "103910700"
  },
  {
    "id": "103910704",
    "name": "质押式回购",
    "level": 2,
    "parentId": "103910700"
  },
  {
    "id": "103910705",
    "name": "股权回购",
    "level": 2,
    "parentId": "103910700"
  },
  {
    "id": "103910706",
    "name": "约定购回",
    "level": 2,
    "parentId": "103910700"
  },
  {
    "id": "103910707",
    "name": "股权分置改革",
    "level": 2,
    "parentId": "103910700"
  },
  {
    "id": "103910708",
    "name": "可转债",
    "level": 2,
    "parentId": "103910700"
  },
  {
    "id": "103910800",
    "name": "一般公告",
    "level": 1,
    "parentId": "103910000"
  },
  {
    "id": "103910801",
    "name": "投资理财",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910802",
    "name": "员工持股",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910803",
    "name": "股权激励",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910804",
    "name": "政策影响",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910805",
    "name": "权证公告",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910806",
    "name": "中介公告",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910807",
    "name": "法律纠纷",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910808",
    "name": "融资融券",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910809",
    "name": "投资者关系",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910810",
    "name": "公司资料变更",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910812",
    "name": "一般补充更正",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910813",
    "name": "其他公告",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910817",
    "name": "经营快报",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910818",
    "name": "股份增减持",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910819",
    "name": "公司制度文件",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910820",
    "name": "ESG报告",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910822",
    "name": "监事会公告",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910823",
    "name": "问询函及回复",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910827",
    "name": "独立董事声明",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910832",
    "name": "发明专利证书",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910833",
    "name": "关联H股",
    "level": 2,
    "parentId": "103910800"
  },
  {
    "id": "103910900",
    "name": "公司治理",
    "level": 1,
    "parentId": "103910000"
  },
  {
    "id": "103910901",
    "name": "董监高工作报告",
    "level": 2,
    "parentId": "103910900"
  },
  {
    "id": "103910902",
    "name": "内部控制与自查",
    "level": 2,
    "parentId": "103910900"
  },
  {
    "id": "103910903",
    "name": "专项意见",
    "level": 2,
    "parentId": "103910900"
  }
]
