import type { LookupItem } from "./types.js"

export const brokerOrgs: LookupItem[] = [
  {
    "id": "C800150015",
    "name": "野村证券"
  },
  {
    "id": "C800150624",
    "name": "星展银行"
  },
  {
    "id": "C100000001",
    "name": "渤海证券"
  },
  {
    "id": "C100000007",
    "name": "山西证券"
  },
  {
    "id": "C100000009",
    "name": "西南证券"
  },
  {
    "id": "C100000010",
    "name": "南京证券"
  },
  {
    "id": "C100000011",
    "name": "世纪证券"
  },
  {
    "id": "C100000012",
    "name": "中天证券"
  },
  {
    "id": "C100000013",
    "name": "大通证券"
  },
  {
    "id": "C100000014",
    "name": "华泰证券"
  },
  {
    "id": "C100000016",
    "name": "东吴证券"
  },
  {
    "id": "C100000017",
    "name": "东海证券"
  },
  {
    "id": "C100000018",
    "name": "中山证券"
  },
  {
    "id": "C100000019",
    "name": "国海证券"
  },
  {
    "id": "C100000020",
    "name": "招商证券"
  },
  {
    "id": "C100000022",
    "name": "开源证券"
  },
  {
    "id": "C100000023",
    "name": "国信证券"
  },
  {
    "id": "C100000024",
    "name": "方正证券"
  },
  {
    "id": "C100000028",
    "name": "英大证券"
  },
  {
    "id": "C100000029",
    "name": "光大证券"
  },
  {
    "id": "C100000030",
    "name": "长城证券"
  },
  {
    "id": "C100000031",
    "name": "平安证券"
  },
  {
    "id": "C100000032",
    "name": "湘财证券"
  },
  {
    "id": "C100000034",
    "name": "民生证券"
  },
  {
    "id": "C100000035",
    "name": "长城国瑞证券"
  },
  {
    "id": "C100000036",
    "name": "国元证券"
  },
  {
    "id": "C100000037",
    "name": "东莞证券"
  },
  {
    "id": "C100000038",
    "name": "华林证券"
  },
  {
    "id": "C100000041",
    "name": "川财证券"
  },
  {
    "id": "C100000042",
    "name": "东方证券"
  },
  {
    "id": "C100000043",
    "name": "第一创业"
  },
  {
    "id": "C100000044",
    "name": "大同证券"
  },
  {
    "id": "C100000045",
    "name": "金融街证券"
  },
  {
    "id": "C100000046",
    "name": "国联民生"
  },
  {
    "id": "C100000048",
    "name": "首创证券"
  },
  {
    "id": "C100000049",
    "name": "东方财富证券"
  },
  {
    "id": "C100000051",
    "name": "兴业证券"
  },
  {
    "id": "C100000052",
    "name": "华西证券"
  },
  {
    "id": "C100000053",
    "name": "五矿证券"
  },
  {
    "id": "C100000054",
    "name": "华金证券"
  },
  {
    "id": "C100000055",
    "name": "华安证券"
  },
  {
    "id": "C100000056",
    "name": "西部证券"
  },
  {
    "id": "C100000057",
    "name": "联储证券"
  },
  {
    "id": "C100000058",
    "name": "华鑫证券"
  },
  {
    "id": "C100000061",
    "name": "华龙证券"
  },
  {
    "id": "C100000062",
    "name": "中泰证券"
  },
  {
    "id": "C100000063",
    "name": "天府证券"
  },
  {
    "id": "C100000064",
    "name": "万联证券"
  },
  {
    "id": "C100000065",
    "name": "国都证券"
  },
  {
    "id": "C100000067",
    "name": "万和证券"
  },
  {
    "id": "C100000068",
    "name": "华创证券"
  },
  {
    "id": "C100000069",
    "name": "红塔证券"
  },
  {
    "id": "C100000070",
    "name": "中银证券"
  },
  {
    "id": "C100000071",
    "name": "华宝证券"
  },
  {
    "id": "C100000072",
    "name": "国融证券"
  },
  {
    "id": "C100000073",
    "name": "财达证券"
  },
  {
    "id": "C100000075",
    "name": "浙商证券"
  },
  {
    "id": "C100000076",
    "name": "金元证券"
  },
  {
    "id": "C100000077",
    "name": "财信证券"
  },
  {
    "id": "C100000078",
    "name": "爱建证券"
  },
  {
    "id": "C100000079",
    "name": "中邮证券"
  },
  {
    "id": "C100000080",
    "name": "中航证券"
  },
  {
    "id": "C100000081",
    "name": "中原证券"
  },
  {
    "id": "C100000082",
    "name": "华源证券"
  },
  {
    "id": "C100000083",
    "name": "国盛证券"
  },
  {
    "id": "C100000084",
    "name": "德邦证券"
  },
  {
    "id": "C100000085",
    "name": "财通证券"
  },
  {
    "id": "C100000086",
    "name": "诚通证券"
  },
  {
    "id": "C100000088",
    "name": "江海证券"
  },
  {
    "id": "C100000089",
    "name": "国开证券"
  },
  {
    "id": "C100000090",
    "name": "太平洋"
  },
  {
    "id": "C100000093",
    "name": "高盛中国证券"
  },
  {
    "id": "C100000095",
    "name": "中信建投"
  },
  {
    "id": "C100000096",
    "name": "国投证券"
  },
  {
    "id": "C100000097",
    "name": "银泰证券"
  },
  {
    "id": "C100000099",
    "name": "中国银河"
  },
  {
    "id": "C100000100",
    "name": "信达证券"
  },
  {
    "id": "C100000101",
    "name": "国新证券"
  },
  {
    "id": "C100000102",
    "name": "东兴证券"
  },
  {
    "id": "C100000103",
    "name": "北京证券"
  },
  {
    "id": "C100000126",
    "name": "申港证券"
  },
  {
    "id": "C100000128",
    "name": "华兴证券"
  },
  {
    "id": "C100000129",
    "name": "东亚前海证券"
  },
  {
    "id": "C100000130",
    "name": "汇丰前海证券"
  },
  {
    "id": "C100000132",
    "name": "野村东方国际证券"
  },
  {
    "id": "C100000133",
    "name": "摩根大通证券中国"
  },
  {
    "id": "C100000135",
    "name": "甬兴证券"
  },
  {
    "id": "C100000137",
    "name": "金圆统一证券"
  },
  {
    "id": "C100000140",
    "name": "星展证券中国"
  },
  {
    "id": "C100000004",
    "name": "华福证券"
  },
  {
    "id": "C100000005",
    "name": "粤开证券"
  },
  {
    "id": "C100000015",
    "name": "东北证券"
  },
  {
    "id": "C100000025",
    "name": "麦高证券"
  },
  {
    "id": "C100000060",
    "name": "上海证券"
  },
  {
    "id": "C100000006",
    "name": "国金证券"
  },
  {
    "id": "C100000008",
    "name": "海通证券"
  },
  {
    "id": "C100000021",
    "name": "广发证券"
  },
  {
    "id": "C100000026",
    "name": "中金公司"
  },
  {
    "id": "C100000027",
    "name": "中信证券"
  },
  {
    "id": "C100000039",
    "name": "长江证券"
  },
  {
    "id": "C100000047",
    "name": "国泰海通"
  },
  {
    "id": "C100000050",
    "name": "天风证券"
  },
  {
    "id": "C100000098",
    "name": "瑞银证券"
  },
  {
    "id": "C100000119",
    "name": "申万宏源证券"
  },
  {
    "id": "C800040335",
    "name": "摩根士丹利"
  },
  {
    "id": "C800065266",
    "name": "巴克莱"
  },
  {
    "id": "C800070012",
    "name": "德意志银行"
  },
  {
    "id": "C800105979",
    "name": "汇丰控股"
  },
  {
    "id": "C800110443",
    "name": "高盛"
  },
  {
    "id": "C800110523",
    "name": "美国银行"
  },
  {
    "id": "C800114009",
    "name": "摩根大通"
  },
  {
    "id": "C800014962",
    "name": "坎特菲茨杰拉德公司"
  },
  {
    "id": "C800015193",
    "name": "巴西投资银行"
  },
  {
    "id": "C800015458",
    "name": "BMO Harris Bank"
  },
  {
    "id": "C800018355",
    "name": "奥尔巴赫格雷森投资"
  },
  {
    "id": "C800019294",
    "name": "Btic America Corporation"
  },
  {
    "id": "C800020171",
    "name": "联昌证券"
  },
  {
    "id": "C800020225",
    "name": "奥地利第一储蓄银行"
  },
  {
    "id": "C800020841",
    "name": "瑞士信贷集团"
  },
  {
    "id": "C800021184",
    "name": "Evercore"
  },
  {
    "id": "C800022831",
    "name": "里昂证券"
  },
  {
    "id": "C800024532",
    "name": "道明证券"
  },
  {
    "id": "C800033691",
    "name": "麦格理"
  },
  {
    "id": "C800038847",
    "name": "古根海姆证券"
  },
  {
    "id": "C800044779",
    "name": "加拿大皇家银行"
  },
  {
    "id": "C800045141",
    "name": "美国投资银行派杰公司"
  },
  {
    "id": "C800050267",
    "name": "法国兴业银行"
  },
  {
    "id": "C800054695",
    "name": "威廉博莱公司"
  },
  {
    "id": "C800055019",
    "name": "Truist证券"
  },
  {
    "id": "C800055550",
    "name": "韦德布什证券"
  },
  {
    "id": "C801298117",
    "name": "Barclays Bank"
  },
  {
    "id": "C801316708",
    "name": "北欧联合银行"
  },
  {
    "id": "C801317677",
    "name": "BNP Paribas SA"
  },
  {
    "id": "C801303042",
    "name": "杰富瑞集团"
  },
  {
    "id": "C801304832",
    "name": "加拿大丰业银行"
  },
  {
    "id": "C801196501",
    "name": "加拿大帝国商业银行"
  },
  {
    "id": "C801196577",
    "name": "贝伦伯格资管"
  },
  {
    "id": "C801196841",
    "name": "挪威DNB投资银行"
  },
  {
    "id": "C801198303",
    "name": "富国证券"
  },
  {
    "id": "C900006685",
    "name": "开普勒盛富证券"
  },
  {
    "id": "C900006686",
    "name": "帕累托证券"
  },
  {
    "id": "C900006687",
    "name": "TD Securities"
  },
  {
    "id": "C900006694",
    "name": "国民银行"
  },
  {
    "id": "C801342605",
    "name": "蒙特利尔银行"
  },
  {
    "id": "C900006697",
    "name": "BTIG"
  },
  {
    "id": "C100000092",
    "name": "高华证券"
  },
  {
    "id": "C100000066",
    "name": "恒泰长财"
  },
  {
    "id": "C100000091",
    "name": "中天国富"
  },
  {
    "id": "C100000107",
    "name": "国联民生证券承销保荐"
  },
  {
    "id": "C100000104",
    "name": "中德证券"
  },
  {
    "id": "C100000117",
    "name": "金通证券"
  },
  {
    "id": "C800016741",
    "name": "伯恩斯坦研究"
  },
  {
    "id": "C800080335",
    "name": "高盛集团"
  },
  {
    "id": "C800090764",
    "name": "花旗银行"
  },
  {
    "id": "C800127057",
    "name": "瑞银集团"
  },
  {
    "id": "C800082057",
    "name": "高盛"
  },
  {
    "id": "C801352341",
    "name": "法巴证券中国"
  },
  {
    "id": "C500000318",
    "name": "上海申银万国证券研究所"
  },
  {
    "id": "C800070011",
    "name": "大和证券"
  },
  {
    "id": "C801318100",
    "name": "法国兴业银行"
  },
  {
    "id": "C900005224",
    "name": "摩根大通"
  },
  {
    "id": "C800025530",
    "name": "银河海外"
  },
  {
    "id": "C800041439",
    "name": "加拿大皇家银行"
  },
  {
    "id": "C800051885",
    "name": "瑞银"
  },
  {
    "id": "C801342334",
    "name": "瑞士信贷"
  },
  {
    "id": "C800031261",
    "name": "杰富瑞金融"
  },
  {
    "id": "C800160866",
    "name": "中信里昂证券"
  },
  {
    "id": "C801322814",
    "name": "挪威银行"
  },
  {
    "id": "C801165257",
    "name": "德意志银行"
  },
  {
    "id": "C800013239",
    "name": "加拿大帝国商业银行"
  },
  {
    "id": "C800035749",
    "name": "贝伦伯格银行"
  },
  {
    "id": "C800103054",
    "name": "蒙特利尔银行"
  },
  {
    "id": "C800100302",
    "name": "加拿大丰业银行"
  },
  {
    "id": "C800103710",
    "name": "National Bank of Canada"
  },
  {
    "id": "C800041170",
    "name": "Piper Sandler"
  },
  {
    "id": "C800090327",
    "name": "花旗"
  },
  {
    "id": "C800142261",
    "name": "威廉博莱"
  },
  {
    "id": "C800096075",
    "name": "海通国际"
  },
  {
    "id": "C900001246",
    "name": "国盛证券"
  },
  {
    "id": "C801361610",
    "name": "国金证券公司"
  }
]
