import type { LookupItem } from "./types.js"

export const meetingOrgs: LookupItem[] = [
  {
    "id": "C000000000",
    "name": "公司自发"
  },
  {
    "id": "C100000006",
    "name": "国金证券"
  },
  {
    "id": "C100000015",
    "name": "东北证券"
  },
  {
    "id": "C100000016",
    "name": "东吴证券"
  },
  {
    "id": "C100000019",
    "name": "国海证券"
  },
  {
    "id": "C100000021",
    "name": "广发证券"
  },
  {
    "id": "C100000022",
    "name": "开源证券"
  },
  {
    "id": "C100000023",
    "name": "国信证券"
  },
  {
    "id": "C100000024",
    "name": "方正证券"
  },
  {
    "id": "C100000026",
    "name": "中金公司"
  },
  {
    "id": "C100000027",
    "name": "中信证券"
  },
  {
    "id": "C100000034",
    "name": "民生证券"
  },
  {
    "id": "C100000039",
    "name": "长江证券"
  },
  {
    "id": "C100000042",
    "name": "东方证券"
  },
  {
    "id": "C100000050",
    "name": "天风证券"
  },
  {
    "id": "C100000051",
    "name": "兴业证券"
  },
  {
    "id": "C100000052",
    "name": "华西证券"
  },
  {
    "id": "C100000056",
    "name": "西部证券"
  },
  {
    "id": "C100000062",
    "name": "中泰证券"
  },
  {
    "id": "C100000068",
    "name": "华创证券"
  },
  {
    "id": "C100000075",
    "name": "浙商证券"
  },
  {
    "id": "C100000083",
    "name": "国盛证券"
  },
  {
    "id": "C100000084",
    "name": "德邦证券"
  },
  {
    "id": "C100000085",
    "name": "财通证券"
  },
  {
    "id": "C100000096",
    "name": "国投证券"
  },
  {
    "id": "C100000099",
    "name": "银河证券"
  },
  {
    "id": "C100000100",
    "name": "信达证券"
  },
  {
    "id": "C100000020",
    "name": "招商证券"
  },
  {
    "id": "C100000029",
    "name": "光大证券"
  },
  {
    "id": "C100000014",
    "name": "华泰证券"
  },
  {
    "id": "C100000058",
    "name": "华鑫证券"
  },
  {
    "id": "C100000090",
    "name": "太平洋证券"
  },
  {
    "id": "C100000055",
    "name": "华安证券"
  },
  {
    "id": "C100000009",
    "name": "西南证券"
  },
  {
    "id": "C100000080",
    "name": "中航证券"
  },
  {
    "id": "C200000294",
    "name": "泓德基金"
  },
  {
    "id": "C100000046",
    "name": "国联民生证券"
  },
  {
    "id": "C100000049",
    "name": "东方财富证券"
  },
  {
    "id": "C100000048",
    "name": "首创证券"
  },
  {
    "id": "C100000030",
    "name": "长城证券"
  },
  {
    "id": "C100000004",
    "name": "华福证券"
  },
  {
    "id": "C100000053",
    "name": "五矿证券"
  },
  {
    "id": "C100000128",
    "name": "华兴证券"
  },
  {
    "id": "C100000060",
    "name": "上海证券"
  },
  {
    "id": "C100000129",
    "name": "东亚前海证券"
  },
  {
    "id": "C100000092",
    "name": "高华证券"
  },
  {
    "id": "C100000130",
    "name": "汇丰前海证券"
  },
  {
    "id": "C100000031",
    "name": "平安证券"
  },
  {
    "id": "C100000007",
    "name": "山西证券"
  },
  {
    "id": "C100000126",
    "name": "申港证券"
  },
  {
    "id": "C100000132",
    "name": "野村东方国际"
  },
  {
    "id": "C100000079",
    "name": "中邮证券"
  },
  {
    "id": "C100000041",
    "name": "川财证券"
  },
  {
    "id": "C900005224",
    "name": "摩根大通"
  },
  {
    "id": "C100000103",
    "name": "北京证券"
  },
  {
    "id": "C900000031",
    "name": "帕米尔研究"
  },
  {
    "id": "C800399320",
    "name": "天天基金"
  },
  {
    "id": "C100000102",
    "name": "东兴证券"
  },
  {
    "id": "C200000203",
    "name": "嘉实基金"
  },
  {
    "id": "C801190083",
    "name": "国富基金"
  },
  {
    "id": "C200000202",
    "name": "华安基金"
  },
  {
    "id": "C200000293",
    "name": "天弘基金"
  },
  {
    "id": "C100000071",
    "name": "华宝证券"
  },
  {
    "id": "C200000187",
    "name": "兴业基金"
  },
  {
    "id": "C200000181",
    "name": "九泰基金"
  },
  {
    "id": "C200000168",
    "name": "工银瑞信基金"
  },
  {
    "id": "C200000165",
    "name": "华夏基金"
  },
  {
    "id": "C800726698",
    "name": "慧衍基金"
  },
  {
    "id": "C800250920",
    "name": "汇成基金"
  },
  {
    "id": "C800070921",
    "name": "第一上海证券"
  },
  {
    "id": "C100000036",
    "name": "国元证券"
  },
  {
    "id": "C100000017",
    "name": "东海证券"
  },
  {
    "id": "C100000119",
    "name": "申万宏源证券"
  },
  {
    "id": "C100000047",
    "name": "国泰海通"
  },
  {
    "id": "C100000095",
    "name": "中信建投"
  },
  {
    "id": "C200000163",
    "name": "易方达基金"
  },
  {
    "id": "C200000207",
    "name": "万家基金"
  },
  {
    "id": "C200000265",
    "name": "大成基金"
  },
  {
    "id": "C200000173",
    "name": "国金基金"
  },
  {
    "id": "C200000270",
    "name": "招商基金"
  },
  {
    "id": "C200000276",
    "name": "平安基金"
  },
  {
    "id": "C200000190",
    "name": "广发基金"
  },
  {
    "id": "C100000070",
    "name": "中银证券"
  },
  {
    "id": "C200000263",
    "name": "鹏华基金"
  },
  {
    "id": "C100000054",
    "name": "华金证券"
  },
  {
    "id": "C200000201",
    "name": "国泰基金"
  },
  {
    "id": "C200000170",
    "name": "华商基金"
  },
  {
    "id": "C100000135",
    "name": "甬兴证券"
  },
  {
    "id": "C200000223",
    "name": "汇添富基金"
  },
  {
    "id": "C200000228",
    "name": "中欧基金"
  },
  {
    "id": "C800164483",
    "name": "中银国际证券"
  },
  {
    "id": "C100000082",
    "name": "华源证券"
  },
  {
    "id": "C200000300",
    "name": "南华基金"
  },
  {
    "id": "C100000078",
    "name": "爱建证券"
  },
  {
    "id": "C100000001",
    "name": "渤海证券"
  },
  {
    "id": "C100000073",
    "name": "财达证券"
  },
  {
    "id": "C100000081",
    "name": "中原证券"
  },
  {
    "id": "C100000044",
    "name": "大同证券"
  },
  {
    "id": "C100000037",
    "name": "东莞证券"
  },
  {
    "id": "C100000005",
    "name": "粤开证券"
  },
  {
    "id": "C100000028",
    "name": "英大证券"
  },
  {
    "id": "C100000065",
    "name": "国都证券"
  },
  {
    "id": "C100000097",
    "name": "银泰证券"
  },
  {
    "id": "C100000045",
    "name": "金融街证券"
  },
  {
    "id": "C100000063",
    "name": "宏信证券"
  },
  {
    "id": "C100000032",
    "name": "湘财证券"
  },
  {
    "id": "C100000064",
    "name": "万联证券"
  },
  {
    "id": "C100000011",
    "name": "世纪证券"
  },
  {
    "id": "C100000010",
    "name": "南京证券"
  },
  {
    "id": "C100000076",
    "name": "金元证券"
  },
  {
    "id": "C100000088",
    "name": "江海证券"
  },
  {
    "id": "C100000101",
    "name": "国新证券"
  },
  {
    "id": "C100000086",
    "name": "诚通证券"
  },
  {
    "id": "C200000275",
    "name": "民生加银基金"
  },
  {
    "id": "C200000272",
    "name": "景顺长城基金"
  },
  {
    "id": "C600000255",
    "name": "恒泰期货"
  },
  {
    "id": "C100000061",
    "name": "华龙证券"
  },
  {
    "id": "C600000293",
    "name": "南华期货"
  },
  {
    "id": "C600000301",
    "name": "中州期货"
  },
  {
    "id": "C600000275",
    "name": "国联期货"
  },
  {
    "id": "C600000312",
    "name": "国信期货"
  },
  {
    "id": "C600000253",
    "name": "光大期货"
  },
  {
    "id": "C600000358",
    "name": "平安期货"
  },
  {
    "id": "C600000292",
    "name": "新湖期货"
  },
  {
    "id": "C600000267",
    "name": "东证期货"
  },
  {
    "id": "C600000333",
    "name": "广发期货"
  },
  {
    "id": "C600000304",
    "name": "徽商期货"
  },
  {
    "id": "C600000237",
    "name": "兴证期货"
  },
  {
    "id": "C100000025",
    "name": "麦高证券"
  },
  {
    "id": "C600000221",
    "name": "国泰君安期货"
  }
]
