import type { LookupItem } from "./types.js"

export const researchAreas: LookupItem[] = [
  {
    "id": "122000001",
    "name": "宏观"
  },
  {
    "id": "122000002",
    "name": "策略"
  },
  {
    "id": "122000003",
    "name": "固收"
  },
  {
    "id": "122000004",
    "name": "金工"
  },
  {
    "id": "122000005",
    "name": "海外"
  },
  {
    "id": "100800122",
    "name": "中信非银"
  },
  {
    "id": "100800115",
    "name": "中信消服"
  },
  {
    "id": "100800111",
    "name": "中信电新"
  },
  {
    "id": "100800104",
    "name": "中信电公"
  },
  {
    "id": "100800101",
    "name": "中信石油石化"
  },
  {
    "id": "100800130",
    "name": "中信综合"
  },
  {
    "id": "100800129",
    "name": "中信传媒"
  },
  {
    "id": "100800128",
    "name": "中信计算机"
  },
  {
    "id": "100800127",
    "name": "中信通信"
  },
  {
    "id": "100800126",
    "name": "中信电子"
  },
  {
    "id": "100800125",
    "name": "中信交通运输"
  },
  {
    "id": "100800124",
    "name": "中信综合金融"
  },
  {
    "id": "100800123",
    "name": "中信房地产"
  },
  {
    "id": "100800121",
    "name": "中信银行"
  },
  {
    "id": "100800120",
    "name": "中信农林牧渔"
  },
  {
    "id": "100800119",
    "name": "中信食品饮料"
  },
  {
    "id": "100800118",
    "name": "中信医药"
  },
  {
    "id": "100800117",
    "name": "中信纺织服装"
  },
  {
    "id": "100800116",
    "name": "中信家电"
  },
  {
    "id": "100800114",
    "name": "中信商贸零售"
  },
  {
    "id": "100800113",
    "name": "中信汽车"
  },
  {
    "id": "100800112",
    "name": "中信国防军工"
  },
  {
    "id": "100800110",
    "name": "中信机械"
  },
  {
    "id": "100800109",
    "name": "中信轻工制造"
  },
  {
    "id": "100800108",
    "name": "中信建材"
  },
  {
    "id": "100800107",
    "name": "中信建筑"
  },
  {
    "id": "100800106",
    "name": "中信基础化工"
  },
  {
    "id": "100800105",
    "name": "中信钢铁"
  },
  {
    "id": "100800103",
    "name": "中信有色金属"
  },
  {
    "id": "100800102",
    "name": "中信煤炭"
  },
  {
    "id": "104770000",
    "name": "申万美容护理"
  },
  {
    "id": "104760000",
    "name": "申万环保"
  },
  {
    "id": "104750000",
    "name": "申万石油石化"
  },
  {
    "id": "104740000",
    "name": "申万煤炭"
  },
  {
    "id": "104730000",
    "name": "申万通信"
  },
  {
    "id": "104720000",
    "name": "申万传媒"
  },
  {
    "id": "104710000",
    "name": "申万计算机"
  },
  {
    "id": "104650000",
    "name": "申万国防军工"
  },
  {
    "id": "104640000",
    "name": "申万机械设备"
  },
  {
    "id": "104630000",
    "name": "申万电力设备"
  },
  {
    "id": "104620000",
    "name": "申万建筑装饰"
  },
  {
    "id": "104610000",
    "name": "申万建筑材料"
  },
  {
    "id": "104510000",
    "name": "申万综合"
  },
  {
    "id": "104490000",
    "name": "申万非银金融"
  },
  {
    "id": "104480000",
    "name": "申万银行"
  },
  {
    "id": "104460000",
    "name": "申万社会服务"
  },
  {
    "id": "104450000",
    "name": "申万商贸零售"
  },
  {
    "id": "104430000",
    "name": "申万房地产"
  },
  {
    "id": "104420000",
    "name": "申万交通运输"
  },
  {
    "id": "104410000",
    "name": "申万公用事业"
  },
  {
    "id": "104370000",
    "name": "申万医药生物"
  },
  {
    "id": "104360000",
    "name": "申万轻工制造"
  },
  {
    "id": "104350000",
    "name": "申万纺织服饰"
  },
  {
    "id": "104340000",
    "name": "申万食品饮料"
  },
  {
    "id": "104330000",
    "name": "申万家用电器"
  },
  {
    "id": "104280000",
    "name": "申万汽车"
  },
  {
    "id": "104270000",
    "name": "申万电子"
  },
  {
    "id": "104240000",
    "name": "申万有色金属"
  },
  {
    "id": "104230000",
    "name": "申万钢铁"
  },
  {
    "id": "104220000",
    "name": "申万基础化工"
  },
  {
    "id": "104110000",
    "name": "申万农林牧渔"
  }
]
